/*Створи об'єкт, що описує автомобіль 
(виробник, модель, рік випуску, середня швидкість, обсяг паливного бака, середня витрата палива на 100 км., водії), 
і наступні функції для роботи з цим об'єктом:
1 Висновок на екран з інформацією про автомобіль.
2 Додавання водія, який має право керувати автомобілем.
3 Заправка автомобіля.
4 Підрахунок необхідного часу для подолання переданої відстані з середньою швидкістю. 
    Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину, 
    а також потрібно перевіряти чи має право водій керувати даним автомобілем 
    (ім'я водія функція приймає другим аргументом). 
    Також потрібно перевірити чи вистачить палива, для здійснення цієї поїздки, 
    якщо палива не вистачить потрібно вивести повідомлення, про це і запропонувати заправити автомобіль. */

let mashina = {
    produce: 'Trabant',
    model: 'P 601',
    year: 1989,
    averSpeed: 60,
    fuelCapacity: 24,
	fuelConsume: 6.8,
	drivers: [],
    actualFuel: 0,
}

// 1 Висновок на екран з інформацією про автомобіль.
function infoAuto(car) {
    console.log(`${car.produce} - ${car.model},
    рік: ${car.year} року випуску,
    Середня швидкість: ${car.averSpeed} км/год,
    Паливний бак: ${car.fuelCapacity},
	Витрата пального: ${car.fuelConsume}`,
    );
}

// 2 Додавання водія, який має право керувати автомобілем.
function addDriver(car, driver) {
    return car.drivers.Push(driver);
}

// 3 Заправка автомобіля.
function fuelUp(car, fuel) {
    if (car.fuel += fuel > car.fuelCapacity) {
        car.fuel = car.fuelCapacity;
    } else {
        car.fuel += fuel;
    }
}

/*4 Підрахунок необхідного часу для подолання переданої відстані з середньою швидкістю. 
    Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину, 
    а також потрібно перевіряти чи має право водій керувати даним автомобілем 
    (ім'я водія функція приймає другим аргументом). 
    Також потрібно перевірити чи вистачить палива, для здійснення цієї поїздки, 
    якщо палива не вистачить потрібно вивести повідомлення, про це і запропонувати заправити автомобіль. */

    infoAuto(mashina);
    addDriver(mashina, 'дід Панас');
    fuelUp(mashina, 120);