//Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.
/*const interestRate = 5%;
const dayOfYear = 356;
let amountDeposit = prompt("Сума вкладу");
let periodMonth = prompt("Скільки місяців");
let interestPerYear = amountDeposit + interestRate;
let interestOneDay = interestPerYear / dayOfYear;
alert(`${interestOneDay}`);*/

// Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.
let sum = 0.1 + 0.2;
alert(sum.toFixed(1));

// Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.
let number = 1;
n = 2;
alert(number + n);

// Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.
let sizeFlashDrive = prompt("Вкажіть розмір флешки в ГБ");
const sizeFile = 0.82;
let amountFile = sizeFlashDrive / 0.82;
alert(Math.round(amountFile));

// Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. 
// Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.

// Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор% (залишок від ділення).

// Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.

// Що повернуть вираження:
// 2 && 0 && 3
// 2 || 0 || 3
// 2 && 0 || 3

