// Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.
let sum = 0.1 + 0.2;
alert(sum.toFixed(1));

// Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.
let a = "1";
let b = 2;
alert(+a + b);

// Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.
let sizeFlashDrive = +prompt("Вкажіть розмір флешки в ГБ");
const sizeFile = 1024 / 820;
let amountFile = sizeFlashDrive * sizeFile;
alert(Math.round(amountFile));

/* Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. 
   Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.*/

// Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор% (залишок від ділення).
let userNumber = prompt("Введіть будь ласка трьохзначне число.");
let number1 = userNumber % 10;
let number2 = (userNumber - number1) / 10 % 10;
let number3 = (userNumber - number1 - number2) / 100 % 10;
let revers = number1 * 100 + number2 * 10 + number3;
alert(`${revers.toFixed(0)}`);

// Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.
let userDeposit = +prompt("Введіть будь ласка суму депозиту");
let termMonth = +prompt("Введіть буль ласка термін");
let percentMonth = userDeposit * ((0.05 / 12) * termMonth);
alert(`Сума нарахованих відсотків за два місяці становитиме ${percentMonth.toFixed(2)}`);

// Що повернуть вираження:
 2 && 0 && 3 // буде 0
 2 || 0 || 3 // буде 2
 2 && 0 || 3 // буде 3